{
  "entries": [
    {
      "id": 1,
      "date": "January 13th, 2019",
      "conceptsCovered": "Objects",
      "entry": "learning how to create an object to push into an array for my journal entries",
      "mood": "pessimistic"
    },
    {
      "id": 2,
      "date": "January 20th, 2019",
      "conceptsCovered": "Recovered everything from last week.",
      "entry": "Tackled all the issues from last week I needed to.",
      "mood": "tired"
    },
    {
      "id": 3,
      "date": "January 21st, 2019",
      "conceptsCovered": "Coverting js into HTML representation on the DOM",
      "entry": "Successfully wrote code to display journal entries on the DOM",
      "mood": "happy"
    },
    {
      "id": 4,
      "date": "January 22nd, 2019",
      "conceptsCovered": "Used fetch to connect api data with js file",
      "entry": "Wasn't running both servers, so it took a minute to figure out why it wasn't loading on the brower",
      "mood": "optimistic"
    },
    {
      "id": 5,
      "date": "January 23rd, 2019",
      "conceptsCovered": "Group Project-Welcome to Nashville",
      "entry": "Group project goal is to create an app where the user can select different activites and add to an itinerary. Discussed a plan for executing the MVP. Each person picked their API and made sure they had their access key.",
      "mood": "optimistic"
    },
    {
      "id": 6,
      "date": "January 24th, 2019",
      "conceptsCovered": "Group Project-Welcome to Nashville",
      "entry": "Used fetch to retrieve user-input specific information from our APIs and wrote js function to print information to the DOM. Using github a lot in our project. Set restrictions to ensure two people must approve pull request before merging with master. Team is communicating well, and working together. We're making sure everyone is on the same page before moving on the the next task",
      "mood": "optimistic"
    },
    {
      "id": 7,
      "date": "January 29th, 2019",
      "conceptsCovered": "Group Project-Welcome to Nashville",
      "entry": "We presented our project. We briefly discussed Grunt, but I need to watch tutorial videos to get more of a grasp on its purpose and how to use it.",
      "mood": "optimistic"
    },
    {
      "id": 8,
      "date": "January 30th, 2019",
      "conceptsCovered": "Collecting User Input",
      "entry": "Saved user input to my API. Used POST instead of GET. Learned about data structure.",
      "mood": "tired"
    },
    {
      "date": "2019-02-01",
      "conceptsCovered": "Lab Day",
      "entry": "Working on my daily journal. Taking the value from my daily journal input with an event listener, and storing it into an object. Then using fetch to POST that input object into my database. ",
      "mood": "enthusiastic",
      "id": 9
    },
    {
      "date": "2019-02-01",
      "conceptsCovered": "Lab Day",
      "entry": "Working on daily journal. Taking the value of the input field using an event listener, and storing it into an object. Using fetch to POST that object into my daily journal database. ",
      "mood": "enthusiastic",
      "id": 10
    },
    {
      "date": "2019-02-01",
      "conceptsCovered": "Lab Day",
      "entry": "Now I'm working on factory function exercises. Given a real life situation where client wants their databased organized.  ",
      "mood": "energetic",
      "id": 11
    },
    {
      "date": "",
      "conceptsCovered": "",
      "entry": "",
      "mood": "enthusiastic",
      "id": 12
    }
  ]
}